MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_crs.c
  * @brief   CRS HAL module driver.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (CRS)
#if defined(USE_HAL_CRS_MODULE) && (USE_HAL_CRS_MODULE == 1U)

/** @addtogroup CRS
  * @{
  */
/** @defgroup CRS_Introduction CRS Introduction
  * @{

The clock recovery system (CRS) is an advanced digital controller acting on the internal fine-grained trimmable
RC oscillator HSI144.
The CRS provides a means to evaluate the oscillator output frequency based on comparison with a selectable
synchronization signal.
The oscillator trimming can be automatically adjusted based on the measured frequency error value, while still allowing
manual trimming when required.
The CRS is ideally suited to provide a precise clock to the USB peripheral. In such a case, the synchronization signal
can be derived from the start-of-frame (SOF) packet signaling on the USB bus,
which is sent by a USB host at 1 ms intervals.
The synchronization signal can also be derived from the LSE oscillator output, or it can be generated by user software.

# Main features
The main features of CRS are described below:
- Selectable synchronization source with programmable prescaler and polarity:
  - LSE oscillator output
  - USB SOF packet reception
- Possibility to generate synchronization pulses by software
- Automatic oscillator trimming capability with no need for CPU action
- Manual control option for faster start-up convergence
- 16-bit frequency error counter with automatic error value capture and reload
- Programmable limit for automatic frequency error value evaluation and status reporting
- Maskable interrupts/events:
 - Expected synchronization (ESYNC)
 - Synchronization OK (SYNCOK)
 - Synchronization warning (SYNCWARN)
 - Synchronization or trimming error (ERR)

  */

/**
  * @}
  */

/** @defgroup CRS_How_To_Use CRS How To Use
  * @{

# How to use the HAL CRS driver

## The HAL CRS driver can be used as follows:
- Enable HSI144 in the system clock configuration.
- Initialize the CRS handle with HAL_CRS_Init().
  Enable the CRS clock by setting USE_HAL_CRS_CLK_ENABLE_MODEL to HAL_CLK_ENABLE_PERIPH_ONLY.
- Set the configuration of the CRS to choose the source, the input polarity, the divider of the selected source,
  the reload value, the frequency error limit value, and whether to use automatic trimming with HAL_CRS_SetConfig().
  This operation is optional. Keep the default configuration if it is suitable.
  Retrieve the default configuration by calling HAL_CRS_ResetConfig().
  You can also use the @ref HAL_CRS_CALCULATE_RELOAD macro to calculate the reload value directly from the target
  and synchronization frequencies.
  Note: When using USB LPM (Link Power Management) and the device is in Sleep mode, the periodic USB SOF is not
  generated by the host.
  Therefore, no synchronization signal is provided to the CRS to calibrate the HSI144 while running.
  To guarantee the required clock precision after waking up from Sleep mode, use the LSE or reference clock on the GPIOs
  as the synchronization signal.

### Polling mode operation:
- Start the CRS driver with HAL_CRS_StartSync() to enable the frequency error counter.
- Use HAL_CRS_PollForSync() to wait for complete synchronization.
  Based on the status, adjust the trimming or the synchronization source, or continue the application if synchronization
  is OK.
  Retrieve error codes with HAL_CRS_GetLastErrorCodes() and information related to synchronization with
  HAL_CRS_GetFrequencyErrorInfo().
- To update error codes and synchronization information, call HAL_CRS_StopSync() before changing the synchronization
  configuration with HAL_CRS_SetConfig(), then call HAL_CRS_StartSync() again.
  Note: When the synchronization event is detected during the downcounting phase (before reaching the zero value),
  this means that the actual frequency is lower than the target, so the trimming value must be incremented.
  When it is detected during the upcounting phase, this means that the actual frequency is higher, so the trimming value
  must be decremented.

### Interrupt mode operation:
 - Override the weak definitions for the following callbacks:
   - HAL_CRS_SyncOkCallback()
   - HAL_CRS_SyncWarnCallback()
   - HAL_CRS_ExpectedSyncCallback()
   - HAL_CRS_ErrorCallback()
 - Or register callbacks:
   - HAL_CRS_RegisterSyncOkCallback()
   - HAL_CRS_RegisterSyncWarnCallback()
   - HAL_CRS_RegisterExpectedSyncCallback()
   - HAL_CRS_RegisterErrorCallback()
 - Start the CRS driver with HAL_CRS_StartSync_IT() to enable the interrupt sources and receive callbacks.
 - This triggers the overridden weak callbacks or the registered callbacks from HAL_CRS_IRQHandler().

### Generate a software synchronization:
To force a synchronization event, call HAL_CRS_GenerateSoftwareSync().
You can call this function before HAL_CRS_SetConfig() (for example, in the SysTick handler).

### HAL CRS Driver State:

- Use HAL_CRS_GetState() to return the HAL CRS state.
  */
/**
  * @}
  */

/** @defgroup CRS_Configuration_Table CRS Configuration Table
  * @{

# Configuration inside the CRS driver
Configuration defines        | Description           | Default value     | Note
------------------------------| --------------------- | ------------------| -------------------------------------------
USE_ASSERT_DBG_PARAM          | from Preprocessor env | NONE              | Enable parameter checks for HAL
USE_ASSERT_DBG_STATE          | from Preprocessor env | NONE              | Enable state checks for HAL
USE_HAL_CHECK_PARAM           | from hal_conf.h       | 0U                | When set, parameters are checked at runtime
USE_HAL_CRS_MODULE            | from hal_conf.h       | 1U                | Enable the HAL CRS module
USE_HAL_CRS_CLK_ENABLE_MODEL  | from hal_conf.h       | HAL_CLK_ENABLE_NO | Enable peripheral clock gating
USE_HAL_CRS_GET_LAST_ERRORS   | from hal_conf.h       | 0U                | Enable retrieval of the last process error
USE_HAL_CRS_REGISTER_CALLBACKS| from hal_conf.h       | 0U                | Allow the user to define custom callbacks
USE_HAL_CRS_USER_DATA         | from hal_conf.h       | 0U                | When set, user data is defined in the handle
  */
/**
  * @}
  */

