MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_Private_Constants CRS Private Constants
  * @{
  */
#define CRS_SYNC_SOURCE_DEFAULT LL_CRS_SYNC_SOURCE_USB      /*!< Default synchronization source */
/**
  * @}
  */
/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_Private_Macros CRS Private Macros
  * @{
  */
/**
  * @brief Synchronization source
  */
#define IS_CRS_SYNC_SOURCE(source) (((source) == HAL_CRS_SYNC_SOURCE_GPIO) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_LSE) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_USB) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_HSE_1MHZ))

/**
  * @brief Synchronization divider
  */
#define IS_CRS_SYNC_DIVIDER(div)       (((div) == HAL_CRS_SYNC_DIV1) || ((div) == HAL_CRS_SYNC_DIV2) \
                                        || ((div) == HAL_CRS_SYNC_DIV4) || ((div) == HAL_CRS_SYNC_DIV8) \
                                        || ((div) == HAL_CRS_SYNC_DIV16) || ((div) == HAL_CRS_SYNC_DIV32) \
                                        || ((div) == HAL_CRS_SYNC_DIV64) || ((div) == HAL_CRS_SYNC_DIV128))

/**
  * @brief Synchronization polarity
  */
#define IS_CRS_SYNC_POLARITY(polarity)     (((polarity) == HAL_CRS_SYNC_POLARITY_RISING) \
                                            || ((polarity) == HAL_CRS_SYNC_POLARITY_FALLING))

/**
  * @brief Reload
  */
#define IS_CRS_RELOAD(value)  (((value) <= 0xFFFFU))

/**
  * @brief Frequency error limit
  */
#define IS_CRS_FREQUENCY_ERROR_LIMIT(value)   (((value) <= 0xFFU))

/**
  * @brief Trimming
  */
#define IS_CRS_TRIMMING(value) (((value) <= 0x5FU))

/**
  * @brief Auto trimming
  */
#define IS_CRS_AUTO_TRIMMING(state)            (((state) == HAL_CRS_AUTO_TRIMMING_DISABLE) \
                                                || ((state) == HAL_CRS_AUTO_TRIMMING_ENABLE))

/**
  * @brief Instance
  */
#define CRS_INSTANCE(hcrs)            ((CRS_TypeDef *)((uint32_t)(hcrs)->instance))

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup CRS_Exported_Functions
  * @{
  */

/** @addtogroup CRS_Exported_Functions_Group1
  * @{

This section provides a set of functions allowing to initialize and deinitialize the CRS peripheral:

- Call the function HAL_CRS_Init() to initialize the selected CRS handle and associate an instance.
- Call the function HAL_CRS_DeInit() to deinitialize the CRS.
  */

/**
  * @brief  Initialize the CRS according to the associated handle.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS.
  * @param  instance CRS instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_OK            HAL CRS driver correctly initialized for the given CRS instance.
  */
hal_status_t HAL_CRS_Init(hal_crs_handle_t *hcrs, hal_crs_t instance)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_ALL_INSTANCE((CRS_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the handle struct pointer */
  if (hcrs == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcrs->instance = instance;

#if defined(USE_HAL_CRS_CLK_ENABLE_MODEL) && (USE_HAL_CRS_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_CRS_EnableClock();
#endif /* USE_HAL_CRS_CLK_ENABLE_MODEL */

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
  /* Initialize the CRS callback settings */
  hcrs->p_error_cb         = HAL_CRS_ErrorCallback;        /* Error callback */
  hcrs->p_sync_ok_cb       = HAL_CRS_SyncOkCallback;       /* Synchronization ok callback */
  hcrs->p_sync_warn_cb     = HAL_CRS_SyncWarnCallback;     /* Synchronization warning callback */
  hcrs->p_expected_sync_cb = HAL_CRS_ExpectedSyncCallback; /* Expected synchronization callback */
#endif  /* USE_HAL_CRS_REGISTER_CALLBACKS */

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the CRS.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  */
void HAL_CRS_DeInit(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_ALL_INSTANCE((CRS_TypeDef *)(uint32_t)hcrs->instance));

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  /* Stop the CRS */
  LL_CRS_DisableFreqErrorCounter(CRS_INSTANCE(hcrs));

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  hcrs->global_state = HAL_CRS_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group2
  * @{

This section provides a set of functions allowing you to configure the CRS driver:

- Call the function HAL_CRS_SetConfig() to set the different fields needed before starting the CRS driver.
- Call the function HAL_CRS_GetConfig() to retrieve the configuration.
- Call the function HAL_CRS_ResetConfig() to reset the configuration to its default values.
- Call the function HAL_CRS_SetTrimming() to set the trimming value.
- Call the function HAL_CRS_GetTrimming() to retrieve the trimming value.
- Call the function HAL_CRS_GetFrequencyErrorInfo() to retrieve frequency error information.
  */

/**
  * @brief  Configure the CRS driver.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_config Pointer on @ref hal_crs_config_t structure.
  * @note   This function is optional, the user can start the driver with the default configuration.
  * @retval HAL_OK CRS instance has been correctly configured.
  * @retval HAL_INVALID_PARAM When the p_config pointer is NULL.
  */
hal_status_t HAL_CRS_SetConfig(const hal_crs_handle_t *hcrs, const hal_crs_config_t *p_config)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the config struct pointer */
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_CRS_SYNC_DIVIDER(p_config->divider));
  ASSERT_DBG_PARAM(IS_CRS_SYNC_SOURCE(p_config->source));
  ASSERT_DBG_PARAM(IS_CRS_SYNC_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_CRS_RELOAD(p_config->reload));
  ASSERT_DBG_PARAM(IS_CRS_FREQUENCY_ERROR_LIMIT(p_config->frequency_error_limit));
  ASSERT_DBG_PARAM(IS_CRS_TRIMMING(p_config->trimming));
  ASSERT_DBG_PARAM(IS_CRS_AUTO_TRIMMING(p_config->auto_trimming));

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_ConfigTrimming(p_crsx, p_config->trimming, (uint32_t)p_config->auto_trimming);

  LL_CRS_ConfigSynchronization(p_crsx, (uint32_t)p_config->divider | (uint32_t)p_config->source |
                               (uint32_t)p_config->polarity, p_config->reload, p_config->frequency_error_limit);
  return HAL_OK;
}

/**
  * @brief  Get the configuration.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_config Pointer on @ref hal_crs_config_t structure.
  */
void HAL_CRS_GetConfig(const hal_crs_handle_t *hcrs, hal_crs_config_t *p_config)
{
  const CRS_TypeDef *p_crsx;
  uint32_t config;
  uint32_t trimming_config;

  ASSERT_DBG_PARAM(hcrs != NULL);
  /* Check config allocation */
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

  config = LL_CRS_READ_REG(p_crsx, CFGR);
  trimming_config = LL_CRS_READ_REG(p_crsx, CR);

  p_config->divider = (hal_crs_sync_div_t)(uint32_t)(config & CRS_CFGR_SYNCDIV);
  p_config->source = (hal_crs_sync_source_t)(uint32_t)(config & CRS_CFGR_SYNCSRC);
  p_config->polarity = (hal_crs_sync_polarity_t)(uint32_t)(config & CRS_CFGR_SYNCPOL);
  p_config->reload = (config & CRS_CFGR_RELOAD);
  p_config->frequency_error_limit = ((config & CRS_CFGR_FELIM) >> CRS_CFGR_FELIM_Pos);
  p_config->trimming = ((trimming_config & CRS_CR_TRIM) >> CRS_CR_TRIM_Pos);
  p_config->auto_trimming = (hal_crs_auto_trimming_state_t)(uint32_t)(trimming_config & CRS_CR_AUTOTRIMEN);
}

/**
  * @brief  Reset the following fields to their default values:
  *         - The divider is set to not divided.
  *         - The source is set to signal source 3.
  *         - The polarity is set to rising edge.
  *         - The reload is set to 0xBB7FU.
  *         - The felim is set to 0x22U.
  *         - The trimming is set to 0x30U.
  *         - The auto trimming is disabled.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  */
void HAL_CRS_ResetConfig(const hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_DisableAutoTrimming(p_crsx);


  /* Reset the Control Register: trimming set to 0x30U and auto trimming disabled */
  LL_CRS_ConfigTrimming(p_crsx, LL_CRS_HSI144CALIBRATION_DEFAULT, LL_CRS_AUTO_TRIMMING_DISABLE);
  /**
    * Reset the Configuration Register: divider set to not divided, source set to signal source 3,
    * polarity set to rising edge, felim set to 0x22U and reload set to 0xBB7FU
    */
  LL_CRS_ConfigSynchronization(p_crsx, LL_CRS_SYNC_DIV_1 | CRS_SYNC_SOURCE_DEFAULT | LL_CRS_SYNC_POLARITY_RISING,
                               LL_CRS_RELOADVALUE_DEFAULT, LL_CRS_ERRORLIMIT_DEFAULT);

