MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
  /* Reset the Interrupt Flag Clear Register: clear ESYNC, ERR, SYNCWARN and SYNCOK flags */
  LL_CRS_ClearFlag(p_crsx, (LL_CRS_ICR_SYNCOKC | LL_CRS_ICR_SYNCWARNC | LL_CRS_ICR_ERRC | LL_CRS_ICR_ESYNCC));
}

/**
  * @brief  Set the trimming value.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  trimming Trimming value.
  * @retval HAL_OK CRS instance has been correctly configured.
  * @retval HAL_ERROR Auto trimming enabled, configuration not possible.
  */
hal_status_t HAL_CRS_SetTrimming(const hal_crs_handle_t *hcrs, uint32_t trimming)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_TRIMMING(trimming));

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Check if the auto trimming is disabled */
  if (LL_CRS_IsEnabledAutoTrimming(p_crsx) != 0U)
  {
    return HAL_ERROR;
  }
  LL_CRS_SetHSI144SmoothTrimming(p_crsx, trimming);
  return HAL_OK;
}

/**
  * @brief  Get the trimming value.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval uint32_t Trimming value.
  */
uint32_t HAL_CRS_GetTrimming(const hal_crs_handle_t *hcrs)
{
  const CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);
  return (LL_CRS_GetHSI144SmoothTrimming(p_crsx));
}

/**
  * @brief  Get frequency error information (frequency error capture and direction).
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_frequency_error_info Pointer on @ref hal_crs_frequency_error_info_t structure.
  */
void HAL_CRS_GetFrequencyErrorInfo(const hal_crs_handle_t *hcrs,
                                   hal_crs_frequency_error_info_t *p_frequency_error_info)
{
  const CRS_TypeDef *p_crsx;
  uint32_t info;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_frequency_error_info != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

  info = LL_CRS_GetFreqErrorInfo(p_crsx);

  /* Get Frequency error capture */
  p_frequency_error_info->frequency_error_capture = LL_CRS_READ_FREQ_ERROR_CAPTURE(info);

  /* Get Frequency error direction */
  p_frequency_error_info->frequency_error_dir = (hal_crs_frequency_error_dir_t)(uint32_t)
                                                LL_CRS_READ_FREQ_ERROR_DIRECTION(info);
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group3
  * @{

This section provides a set of functions allowing you to start and stop the CRS driver and control auto trimming:

- Call the functions HAL_CRS_EnableAutoTrimming(), HAL_CRS_DisableAutoTrimming(), and HAL_CRS_IsEnabledAutoTrimming()
  to enable or disable auto trimming and to check whether it is enabled.
- Call the function HAL_CRS_StartSync() to enable the frequency error counter.
- Call the function HAL_CRS_StopSync() to disable the frequency error counter.
- Call the function HAL_CRS_StartSync_IT() to enable the frequency error counter with interrupt sources.
- Call the function HAL_CRS_StopSync_IT() to disable the frequency error counter with interrupt sources.
  */

/**
  * @brief  Enable the auto trimming.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK CRS auto trimming has been correctly activated.
  */
hal_status_t HAL_CRS_EnableAutoTrimming(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  LL_CRS_EnableAutoTrimming(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Disable the auto trimming.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK CRS auto trimming has been correctly de-activated.
  */
hal_status_t HAL_CRS_DisableAutoTrimming(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  LL_CRS_DisableAutoTrimming(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Get the auto trimming status.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_CRS_AUTO_TRIMMING_DISABLED
  * @retval HAL_CRS_AUTO_TRIMMING_ENABLED
  */
hal_crs_auto_trimming_status_t HAL_CRS_IsEnabledAutoTrimming(const hal_crs_handle_t *hcrs)
{
  const CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

  return (hal_crs_auto_trimming_status_t)LL_CRS_IsEnabledAutoTrimming(p_crsx);
}

/**
  * @brief  Start the CRS in Polling mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function enables the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StartSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  LL_CRS_EnableFreqErrorCounter(CRS_INSTANCE(hcrs));

  hcrs->global_state = HAL_CRS_STATE_ACTIVE;

  return HAL_OK;
}

/**
  * @brief  Stop the CRS in Polling mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function disables the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StopSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  LL_CRS_DisableFreqErrorCounter(CRS_INSTANCE(hcrs));

