MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start the CRS in Interrupt mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function enables the interrupt sources and the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StartSync_IT(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  LL_CRS_EnableIT(p_crsx, (LL_CRS_CR_SYNCOKIE | LL_CRS_CR_SYNCWARNIE | LL_CRS_CR_ERRIE | LL_CRS_CR_ESYNCIE));

  LL_CRS_EnableFreqErrorCounter(p_crsx);

  hcrs->global_state = HAL_CRS_STATE_ACTIVE;

  return HAL_OK;
}

/**
  * @brief  Stop the CRS in Interrupt mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function disables the interrupt sources and the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StopSync_IT(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_DisableFreqErrorCounter(p_crsx);

  LL_CRS_DisableIT(p_crsx, (LL_CRS_CR_SYNCOKIE | LL_CRS_CR_SYNCWARNIE | LL_CRS_CR_ERRIE | LL_CRS_CR_ESYNCIE));

  LL_CRS_ClearFlag(p_crsx, (LL_CRS_ICR_SYNCOKC | LL_CRS_ICR_SYNCWARNC | LL_CRS_ICR_ERRC | LL_CRS_ICR_ESYNCC));

  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group4
  * @{

This section provides a set of process functions:

- Call the function HAL_CRS_GenerateSoftwareSync() to generate a software synchronization event.
- Call the function HAL_CRS_PollForSync() to retrieve the status of the synchronization event.
  */

/**
  * @brief  Generate the software synchronization event.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_GenerateSoftwareSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  LL_CRS_GenerateEvent_SWSYNC(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Retrieve the status of synchronization.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param timeout_ms  Duration of the timeout in milliseconds.
  * @note  timeout_ms is based on the maximum time to receive a SYNC event based on synchronization
  *        frequency.
  * @warning  If timeout_ms is set to HAL_MAX_DELAY, HAL_TIMEOUT is never returned.
  * @retval HAL_OK Synchronization event OK (SYNCOK).
  * @retval HAL_ERROR Synchronization error or warning (SYNCERR, TRIMOVF, SYNCMISS or SYNCWARN).
  * @retval HAL_TIMEOUT Timeout elapsed.
  */
hal_status_t HAL_CRS_PollForSync(hal_crs_handle_t *hcrs, uint32_t timeout_ms)
{
  CRS_TypeDef *p_crsx;
  uint32_t tickstart;
  uint32_t flags;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Get timeout */
  tickstart = HAL_GetTick();

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  do
  {
    flags = LL_CRS_READ_REG(p_crsx, ISR);

    /* Check CRS Expected SYNC flag */
    if ((flags & LL_CRS_ISR_ESYNCF) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes |= HAL_CRS_ERROR_EXPECTED_SYNC;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

      LL_CRS_ClearFlag_ESYNC(p_crsx);
    }

    /* Check CRS SYNCOK flag */
    if ((flags & LL_CRS_ISR_SYNCOKF) != 0U)
    {
      LL_CRS_ClearFlag_SYNCOK(p_crsx);

      return HAL_OK;
    }

    /* Check CRS ERR and SYNCWARN flags */
    if (((flags & LL_CRS_ISR_ERRF) == 0U) && ((flags & LL_CRS_ISR_SYNCWARNF) == 0U))
    {
      flags = 0U;
    }
    else /* Error flag or SYNC warning flag set */
    {
      if ((flags & LL_CRS_ISR_TRIMOVF) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_TRIMMING;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCERR) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_ERROR;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCMISS) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_MISSED;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCWARNF) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_WARN;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      LL_CRS_ClearFlag(p_crsx, LL_CRS_ICR_ERRC | LL_CRS_ICR_SYNCWARNC);
    }

    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  } while (flags == 0U);

  return HAL_ERROR;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group5
  * @{

This section provides functions allowing you to:
 - Handle the CRS interrupt request with HAL_CRS_IRQHandler().
There are two ways to use callbacks: override weak callback functions or register user callback functions.
They indicate:
 - When the CRS driver encounters an error (HAL_CRS_ErrorCallback() or callback function registered with
   HAL_CRS_RegisterErrorCallback()). The errors can be synchronization missed, synchronization error or
   trimming overflow or underflow.
 - When a synchronization event OK is triggered (HAL_CRS_SyncOkCallback()
   or callback function registered with HAL_CRS_RegisterSyncOkCallback()).
 - When a synchronization warning is triggered (HAL_CRS_SyncWarnCallback()
   or callback function registered with HAL_CRS_RegisterSyncWarnCallback()).
 - When an expected synchronization is triggered (HAL_CRS_ExpectedSyncCallback()
   or callback function registered with HAL_CRS_RegisterExpectedSyncCallback()).
  */

/**
  * @brief  Handle the Clock Recovery System interrupt request.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note  This function must be called from CRS_IRQHandler().
  */
void HAL_CRS_IRQHandler(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;
  uint32_t it_flags_sources;

  ASSERT_DBG_PARAM(hcrs != NULL);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Get current IT flags and IT sources values */
  it_flags_sources = LL_CRS_READ_REG(p_crsx, ISR);
  it_flags_sources &= LL_CRS_READ_REG(p_crsx, CR);

