MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
  /* Check CRS SYNCOK flag  */
  if ((it_flags_sources & LL_CRS_ISR_SYNCOKF) != 0U)
  {
    LL_CRS_ClearFlag_SYNCOK(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_sync_ok_cb(hcrs);
#else
    HAL_CRS_SyncOkCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS SYNCWARN flag  */
  if ((it_flags_sources & LL_CRS_ISR_SYNCWARNF) != 0U)
  {
    LL_CRS_ClearFlag_SYNCWARN(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_sync_warn_cb(hcrs);
#else
    HAL_CRS_SyncWarnCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS Expected SYNC flag */
  if ((it_flags_sources & LL_CRS_ISR_ESYNCF) != 0U)
  {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
    hcrs->last_error_codes = HAL_CRS_ERROR_EXPECTED_SYNC;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

    LL_CRS_ClearFlag_ESYNC(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_expected_sync_cb(hcrs);
#else
    HAL_CRS_ExpectedSyncCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS Error flags */
  if ((it_flags_sources & LL_CRS_ISR_ERRF) != 0U)
  {

    if ((LL_CRS_IsActiveFlag_SYNCERR(p_crsx)) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_SYNC_ERROR;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }
    else if ((LL_CRS_IsActiveFlag_SYNCMISS(p_crsx)) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_SYNC_MISSED;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }
    else /* Trimming overflow or underflow flag set */
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_TRIMMING;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }

    LL_CRS_ClearFlag_ERR(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_error_cb(hcrs);
#else
    HAL_CRS_ErrorCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Clock Recovery System SYNCOK interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_SyncOkCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System SYNCWARN interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_SyncWarnCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System Expected SYNC interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_ExpectedSyncCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System Error interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_ErrorCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User CRS callback for synchronization ok.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the synchronization ok callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterSyncOkCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_sync_ok_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for synchronization warning.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the synchronization warning callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterSyncWarnCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_sync_warn_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for expected synchronization.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the expected synchronization callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterExpectedSyncCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_expected_sync_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for error.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the error callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterErrorCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

