MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_crs.c
  hcrs->p_error_cb = p_callback;
  return HAL_OK;
}
#endif  /* USE_HAL_CRS_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group6
  * @{
This section permits to get in runtime the state of the peripheral CRS with HAL_CRS_GetState().
  */
/**
  * @brief  Get the CRS state.
  * @param  hcrs Pointer to the CRS handle.
  * @retval hal_crs_state_t HAL CRS state.
  */
hal_crs_state_t HAL_CRS_GetState(const hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  return hcrs->global_state;
}

/**
  * @}
  */

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
/** @addtogroup CRS_Exported_Functions_Group7
  * @{
This section permits to get in runtime the last error codes of the peripheral CRS with HAL_CRS_GetLastErrorCodes().
  */

/**
  * @brief  Get the CRS last error codes.
  * @param  hcrs Pointer to the CRS handle.
  * @retval uint32_t This return value can be a combination of the following values:
  *         @arg @ref HAL_CRS_ERROR_NONE
  *         @arg @ref HAL_CRS_ERROR_SYNC_ERROR
  *         @arg @ref HAL_CRS_ERROR_SYNC_MISSED
  *         @arg @ref HAL_CRS_ERROR_TRIMMING
  *         @arg @ref HAL_CRS_ERROR_EXPECTED_SYNC
  *         @arg @ref HAL_CRS_ERROR_SYNC_WARN
  */
uint32_t HAL_CRS_GetLastErrorCodes(const hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  return hcrs->last_error_codes;
}

/**
  * @}
  */
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

#if defined(USE_HAL_CRS_USER_DATA) && (USE_HAL_CRS_USER_DATA == 1U)
/** @addtogroup CRS_Exported_Functions_Group8
  * @{
This section provides functions allowing to Set and Get user data:
- HAL_CRS_SetUserData() to store the user data into the CRS handle.
- HAL_CRS_GetUserData() to retrieve the user data from the CRS handle.
  */

/**
  * @brief Store the user data into the CRS handle.
  * @param hcrs        Pointer to CRS handle.
  * @param p_user_data Pointer to the user data.
  */
void HAL_CRS_SetUserData(hal_crs_handle_t *hcrs, const void *p_user_data)
{
  /* Check the CRS handle allocation */
  ASSERT_DBG_PARAM(hcrs != NULL);

  /* Set user data */
  hcrs->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the CRS handle.
  * @param  hcrs Pointer to CRS handle.
  * @retval Pointer to the user data.
  */
const void *HAL_CRS_GetUserData(const hal_crs_handle_t *hcrs)
{
  /* Check the CRS handle allocation */
  ASSERT_DBG_PARAM(hcrs != NULL);

  return (hcrs->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_CRS_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_CRS_MODULE */
#endif /* CRS */

/**
  * @}
  */
